Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В Проводнике OC Windows навести указатель мыши на интересующее приложение (в данном случае – C:\Program Files\BaseGroup\Loginom 6\Personal\Embedded.exe).
en: It is required to hover a cursor over the required application in Windows File Explorer (in this case: C:\Program Files\BaseGroup\Loginom 6\Personal\Embedded.exe).

source: В Сценариях имеется возможность создавать Производные компоненты на основе базовых.
en: It is possible to create the Derived Components based on the base ones in the Workflows.

source: В алгоритме первый проход по таблице транзакций служит для построения начального разбиения, определяемого функцией стоимости, после чего для повышения качества кластеризации и оптимизации функции дополнительно сканируются таблицы несколько раз, пока изменения в разбиении не прекратятся.
en: The first transaction table check in the algorithm is required for the first clustering defined by the cost function. Then, to improve the clustering quality and optimize the function, the tables are additionally scanned once again several times, until changes in clustering are stopped.

source: В вариантах поставки Enterprise, Standard и Team при запуске программы открывается стартовая страница с авторизацией.
en: In the case of the Enterprise, Standard and Team delivery editions, when starting the software, the home login page is opened.

source: В варианте Personal авторизация отсутствует.
en: There is no authorization for the Personal version.

source: В верхней части мастера настройки находится Состояния входа.
en: Login status is located in the upper part of the wizard.

source: В верхней части раздела имеется четыре кнопки:
en: There are four buttons in the upper part of the section:

source: В верхней части раздела расположено две кнопки:
en: There are two buttons in the upper part of the section:

source: В виду ограничений БД ClickHouse:
en: In connection with the ClickHouse DB restrictions:

source: В визуализаторе Таблица сортировка данных следует правилам описанным в узле Сортировка.
en: Data sorting in the Table visualizer is performed according to the rules described in the Sorting node.

source: В выражении возможно использовать ссылки на ранее вычисленные выражения, т.е. находящиеся выше в списке выражений.
en: It is possible to use references to the expressions calculated earlier in the expression, namely, the expressions that are higher in the list of expressions.

source: В выходном наборе будут переменные, полученные из полей с помощью выбранных функций агрегации.
en: The output data set will include the variables received from the fields using the selected aggregation functions.

source: В выходном наборе к входному добавляются следующие поля:
en: The following fields are added in the output data set to the input one:

source: В выходных портах обработчика формируются:
en: The following data is generated in the output ports of the handler:

source: В гистограммах Основной таблицы и Панели сравнения кластеров изменяется видимость столбца с пропусками.
en: The column visibility with null data is changed in the Main table and Cluster comparison panel histograms.

source: В группе Факты порядок полей не имеет значения.
en: The order of fields does not matter in the Measures group.

source: В дальнейшем выходные данные созданного подключения используются соответствующим узлом вызова сервиса:
en: Later on, the output data of the created connection is used by corresponding node designated for service calling:

source: В дальнейшем его можно использовать в адресной строке браузера для быстрого перехода к открытому объекту.
en: Subsequently, it can be used in the browser address bar for quick transition to the opened object.

source: В дальнейшем подмодель, выполняющая заданную пользователем функцию, может быть опубликована как производный компонент и наравне со стандартными компонентами многократно использоваться в других сценариях.
en: Later on, the supernode executing the function set by a user can be published as a derived component and frequently used in other workflows along with standard components.

source: В дальнейшем только эти наборы участвуют в формировании правил:
en: Later on, only these itemsets are used to form the rules:

source: В данной таблице содержится информация о выходных диапазонах квантования.
en: This table contains information on the output binning ranges.

source: В данном окне для факта необходимо выбрать функцию агрегации и способ отображения выбранного варианта агрегации.
en: It is required to select aggregation function and representation method of the selected aggregation option in this window fo the measure.

source: В данном подразделе расположены общие настройки.
en: This subsection includes general settings.

source: В данном примере для вычисления переменной result используются ссылки на поля с именами COL1 и COL2.
en: In this example, it is required to use references to the fields with COL1 and COL2 names to calculate the result variable.

source: В данном пункте меню будет отображаться название того формата, который выбран для экспорта:
en: The name of the format that has been selected for export will be displayed in this menu option:

source: В данном скрипте определена функция pow(x, n), принимающая в качестве аргументов число и степень, в которую оно возводится.
en: pow(x, n) function is defined in this script. It takes number and power to which it is risen as arguments.

source: В диалоге помимо редактирования стандартных параметров поля задается параметр кэширования.
en: The dialog enables not only to edit the standard field features but also to set the caching parameter.

source: В дискретных гистограммах Основной таблицы изменяется видимость столбца Прочие.
en: In the discrete histograms of the Main table visibility of Other column is changed.

source: В его основе лежит разделение исходного множества данных на $$k$$ колод, например $$k=5$$.
en: It is based on division of the source data set to $$k$$ folds, for example, $$k=5$$.

source: В журнале регистрации (лог-файле) фиксируется выполнение каждого узла, что позволяет в случае возникновения ошибки выявить ее местоположение и возможную причину.
en: Execution of each node is recorded in the registration log (log file) that enables to detect location of error and its possible reason in the case of error occurrence.

source: В зависимости от заданного условия ход выполнения Сценария может пойти по одной из возможных веток (см.
en: According to the set condition the Workflow execution progress can follow one of possible branches (refer to

source: В зависимости от конкретной ситуации пользователь может включать такие неполные записи в результирующую выборку или исключать их.
en: On case by case basis, a user can include such incomplete records into the resulting sample or exclude them.

source: В зависимости от параметра Оставлять неполные записи получим разные результирующие таблицы.
en: Different resulting tables will be obtained according to Leave incomplete records parameter.

source: В зависимости от структуры передаваемых/принимаемых данных различают следующие типы портов:
en: There are the following port types according to the structure of transferred/accepted data:

source: В задаче классификации (в отличии от задачи регрессии) выходным может быть только поле с дискретным видом данных.
en: Only the field with discrete data kind can be the output one in the classification task (as opposed to the regression task).

source: В задаче регрессии (в отличии от задачи классификации) выходными могут быть только поля с непрерывным видом данных.
en: Only the fields with continuous data kind can be the output ones in the regression task (as opposed to the classification task).

source: В закладке Подробно содержится информация о приложении (типа Версия продукта X.X.X, где X.X.X – номер версии; Версия файла: X.X.X.Y - см.
en: Details tab contains information on the application (for example, application version X.X.X where X.X.X is a version number; file version: X.X.X.Y - refer to the information

source: В имени допускаются буквы латинского алфавита от а до z и от А до Z, знак подчеркивания "_" и цифры.
en: Letters of the Latin alphabet from а to z and from А to Z, underscore "_" character and digits are allowed in the name.

source: В интерфейсе файлового менеджера отображается иерархическая структура доступных пользователю папок и файлов.
en: The hierarchic structure of the folders and files available to a user is displayed in the file manager interface.

source: В каждом значении столбца исходного набора регулярным выражением производится поиск заданной последовательности символов.
en: The regular expression is used to search for the set sequence of characters in each column value of the source data set.

source: В каждом сформированном столбце выделена определенная информация из даты, например, день месяца, минута.
en: Particular information is selected from the date in each generated column, for example, day of the month, minute.

source: В калькуляторе существует два способа расчета выражений:
en: There are two methods used to calculate expressions in the calculator:

source: В качестве входного набора данных используется таблица с параметрами запросов.
en: The table with the request parameters is used as the input data set.

source: В качестве идентификатора метода используется строка, состоящая из имени узла и имени пакета, в котором узел содержится.
en: The string that consists of the node name and name of the package with the node is used as the method identifier.

source: В качестве имени берется введенное имя пользователя, выставляется способ аутентификации "LDAP", не включена ни одна роль (администратора, разработчика, просмотра отчетов, запуска в режиме службы).
en: The entered username is used as a name, the "LDAP" authentification method is set, no roles are defined (administrator, developer, reports view, start in the service mode).

source: В качестве ограничителя строк могут быть использованы символы:
en: The following characters can be used as text qualifiers:

source: В качестве опорных данных будем использовать данные о суммах продаж за предыдущий период.
en: Data on the sales amount in the previous period will be used as reference data.

source: В качестве параметра условий могут выступать управляющие переменные.
en: The control variables can be used as the criteria parameter.

source: В качестве первой главной компоненты избирают направление, вдоль которого массив данных имеет наибольший разброс, а выбор каждой последующей происходит так, чтобы разброс данных вдоль нее был максимальным, и, чтобы она была ортогональна другим главным компонентам, выбранным прежде.
en: As the first main component, it is required to select the direction along which the data array has the widest scatter. Each subsequent one is selected to provide the maximum data scatter along it, and to make it orthogonal relative to other main components selected earlier.

source: В качестве полей-групп выберем поля Дата и Товар, а поле-параметр (по которому будет проводиться агрегация) — Вес, кг.
en: It is required to select the Date and Goods fields as the group fields, and the Weight, kg as the parameter field (it will be used for aggregation).

source: В качестве таких объектов могут выступать узлы сценария, подключения, производные компоненты.
en: Workflow nodes, connections, derived components can be used as such objects.

source: В качестве такого узла, как правило, используется Подмодель, в которой задаются действия выполняемые над данными в каждой итерации.
en: As a rule, the Supernode can be used as such node. The actions performed with data in each iteration are set in it.

source: В коде JavaScript возможно использование функций Калькулятора.
en: It is possible to use the Calculator functions in the JavaScript code.

source: В коде JavaScript можно использовать встроенные функции Калькулятора:
en: It is possible to use built-in functions of Calculator in the JavaScript code:

source: В контекст JavaScript добавлен глобальный объект Console, реализующий базовый функционал Console.
en: The global Console object implementing the basic Console function was added within the JavaScript context.

source: В контекст выполнения JavaScript встроены перечисления, описывающие метаданные полей и переменных.
en: The enumerations describing the fields and variables metadata is built in within the JavaScript execution context.

source: В контексте выполнения JavaScript-кода доступны функции Калькулятора, которые импортируются из встроенного модуля "builtIn/Calc".
en: In the context of the JavaScript code execution, the Calculator functions are available. They are imported from the built-in module"builtIn/Calc".

source: В контекстном меню узла выбрать пункт Переобучить узел.
en: It is required to select Retrain node option in the context menu of the node.

source: В контекстном меню элемента Ссылки выбрать пункт "Добавить".
en: select "Add" option in the context menu of the Reference item.

source: В левом верхнем углу области построения Сценариев располагаются порты переменных Сценария:
en: The ports of the Workflow variables are located in the upper left corner of the Workflow construction area:

source: В левом нижнем углу окна Быстрый просмотр данных выводится общее количество строк в наборе, если все строки не помещаются в окне визуализатора (см.
en: The total count of rows in the data set is shown in the left lower corner of Quick View of Data window if there is no enough space for all rows in the visualizer window (refer to

source: В левом списке отображаются поля, которые можно использовать в качестве осей диаграммы.
en: The fields that can be used as the chart axes are displayed in the left list.

source: В левом списке отображаются поля, по которым можно производить сортировку, и столбцы, видимость которых убрана в Таблице.
en: The fields used for sorting and the columns with the visibility disabled in the Table are displayed in the left list.

source: В левом списке отображаются поля, по которым можно производить сортировку.
en: The fields by which it is possible to perform sorting are displayed in the left list.

source: В мастере настройки количество отсчетов определим равным десяти.
en: The lag count is equal to ten in the wizard.

source: В мастере настройки потом можно будет задать шаблоном
en: Then it will be possible to set using a template in the wizard.

source: В мастере настройки создаются новые переменные и вычисляются их значения в соответствии с выражениями, заданными пользователем.
en: New variables are created and their values are calculated in the wizard according to the expressions set by a user.

source: В многопользовательской версии есть возможность получить гиперссылку на текущий открытый объект.
en: The multiuser edition enables to receive hyperlink to the current opened object.

source: В модулях ES6 поддерживается статический и динамический импорт модулей ES6, для импорта модулей CommonJS применяется функция require (см.
en: The static and dynamic import of ES6 modules is supported in ES6 modules, to import the CommonJS modules, it is required to use require function (refer to

source: В настольной (Desktop) версии Loginom нужно указывать пути вида "C:datadatabases1C" и %% «netdiskdatadatabases1C» %% (соответственно, для локально хранящейся базы и базы на сетевом диске).
en: It is required to specify the following path in the desktop Loginom version: "C:datadatabases1C" and %% «netdiskdatadatabases1C» %% (correspondingly, for the locally stored base and the base on the net drive).

source: В настройках выходного порта "Переменные пользователя", закрепленного в верхнем левом углу области построения Сценария;
en: in the settings of the output port "User variables" in the upper left corner of the Workflow construction area;

source: В настройках портов следует выставить параметр "Назначение" для полей участвующих в обработке.
en: It is required to set "Usage type" parameter for the fields included into processing in the ports settings.

source: В настройках этого порта следует выставить назначение "Используемое" для полей, данные которых следует подвергнуть факторному анализу.
en: It is required to set "Used" designation in the settings of this port for the fields the data of which are subject to the factor analysis.

source: В настройках этого порта следует выставить назначение "Используемое" полям, для которых нужно рассчитать автокорреляцию.
en: "Used" value is set in the settings of this port for the fields for which it is required to calculate autocorrelation.

source: В некоторых значениях БИК содержатся буквы О и З вместо цифр.
en: There are О and З letters instead of digits in some BIC values.

source: В некоторых компонентах используются самообучающиеся алгоритмы — Кластеризация, Самоорганизующиеся карты, Квантование и прочие.
en: Self-training algorithms are used in some components: Clustering, Self-organising maps, Binning, etc.

source: В некоторых нормализаторах дискретных данных используется опорное значение.
en: The reference value is used in some normalizers of discrete data.

source: В нем будет подсчитано, сколько раз в исходном наборе данных встречается каждая комбинация из колонок и строк.
en: It will be calculated how many times each combination of columns and strings occurs in the source data set.

source: В нем следует выбрать поле и уникальное значение из этого поля, для которого устанавливается фактор.
en: It is required to select the field in it and unique value from this field for which the factor is set.

source: В нижней части мастера расположена область Общие настройки для колонок имеющая следующие параметры:
en: The lower wizard part includes the General Columns Settings area that has the following parameters:

source: В нижней части мастера расположены два параметра отмечаемые чекбоксами:
en: Two parameters selected using checkboxes are located in the lower part of the wizard:

source: В нижней части окна расположена панель Процессы.
en: The Processes panel is located in the lower part of the window.

source: В нижней части таблицы отображается сумма:
en: The sum is displayed in the lower part of the table:

source: В области Доступные поля помимо полей входного набора данных всегда присутствует синтетическое поле Количество, оно может быть добавлено только в группу Факты.
en: The Available fields area always contains the Count synthetic field apart from the input data set fields, it can be added only to the Measures group.

source: В области Поле отображаются поля входного набора данных с типом Дата/Время Дата/Время.
en: The input data set fields with Date/Time Date/Time type are displayed in the Field area.

source: В области Разбиение при помощи флажков чекбокса необходимо выбрать формат и тип данных для преобразования.
en: It is required to select the data format and type to be transformed in the Time frames area using the checkboxes.

source: В области ввода задается формула расчета выражения.
en: The expression calculation formula is set in the entry area.

source: В области кода в зависимости от выбранного синтаксиса калькулятора задается формула расчета выражения или JavaScript код.
en: It is required to set the expression calculation formula or the JavaScript code in the code area depending on the selected calculator syntax.

source: В области кода задается формула расчета выражения.
en: The expression calculation formula is set in the code area.

source: В области настройки назначений полей свяжем поля Группа товаров обеих таблиц, полю Сумма продаж, тыс.
en: Let's link the following fields in the area of the field usage type configuration: Group of goods of both tables, Amount of sales, thous.

source: В области настройки объединения предусмотрена возможность сортировки полей таблиц.
en: It is possible to sort the table fields in the union configuration area.

source: В области подключений появится новое подключение (3), и откроется диалог редактирования параметров подключения.
en: New connection (3) will appear in the area of connections, and the dialog of connection parameters editing will be opened.

source: В обозначении банковского БИК должны содержаться только цифры.
en: Only digits must be used in the bank BIC.

source: В обработчике "Факторный анализ" это осуществляется с помощью метода главных компонент.
en: It is achieved in the "Factor Analysis" handler using the main components method.

source: В обработчике имеется возможность предпросмотра результата фильтрации (выводятся первые 25 строк результирующей таблицы).
en: It is possible to preview the filtering result in the handler (the first 25 rows of the resulting table are shown).

source: В обработчике имеется два подхода к решению этой проблемы:
en: The handler provides two approaches to solve this problem:

source: В обратной ситуации, когда все вероятности более-менее одинаковые, и лучший класс выбран лишь «формально», по наибольшему значению, то индекс Джини будет близок к нулю, и классификацию в данном случае можно считать неуверенной.
en: In the reverse situation, when all probabilities are more or less the same, and the best class is selected as a mere formality by the highest value, the Gini index will be close to 0, and, in this case, the classification will be considered to be instable.

source: В общем случае последовательность выполнения узлов задается соединением их входных и выходных портов.
en: In the general case, the order of nodes execution is set by connection of their input and output ports.

source: В окне мастера в виде дерева отображаются доступные для создания ссылки узлы.
en: The nodes available for reference creation are displayed in the wizard window in the form of a tree.

source: В окне мастера настройки предоставляется два варианта записи переменных:
en: Two options of variables record are specified in the wizard:

source: В окне настройки необходимо настроить соответствие между входными данными, которые находятся слева в поле Столбцы исходного набора, и создаваемым деревом данных, которое находится справа в полях Узел дерева и Связанные поля.
en: It is required to configure mapping of the input data that are located to the left in the Source data set columns field, and created data tree that is located to the right in the Tree node and Related fields fields.

source: В окне настройки поиска можно задать режим поиска, режим сравнения и учет регистра.
en: It is possible to set the search mode, comparison mode and case in the search configuration window.

source: В окне располагается область настройки условий фильтрации.
en: Area of the filtering criteria settings is located in the window.

source: В основе EM кластеризации лежит масштабируемый алгоритм EM, который опирается на предположение, что исследуемое множество данных может быть смоделировано с помощью линейной комбинации многомерных нормальных распределений.
en: EM Clustering is based on the scalable EM algorithm that is supported by assumption that the data set under study can be modelled by means of the linear combination of multidimensional probability distributions.

source: В основе кластеризации транзакций лежит алгоритм CLOPE, применение которого позволяет обрабатывать огромные массивы транзакционных данных: чеки в супермаркетах, логи посещений веб-ресурсов и другие.
en: Clustering is based on the CLOPE algorithm. Its usage enables to process huge arrays of transactional data: checks in supermarkets, tracking data of web resources, etc.

source: В основе построения проекта лежит методология структурного проектирования — представление алгоритма в виде иерархической структуры блоков.
en: The project construction is based on the structural design methodology— representation of an algorithm in the form of hierarchic structure of blocks.
